#!/bin/sh
ScriptPath=$(cd "$(dirname "$0")"; pwd)
cd ${ScriptPath}
cd ../
PanelPath=$(pwd)
cd ../
echo "【部署发布】"
echo "  - 是否先清除缓存 ( y / n )"
echo "    [注意] 如选择清除缓存，清除结束将自动处理后续部署发布步骤"
echo "    [注意] 清除之前建议执行命令7，检查豆瓣文件夹是否备份在 /source/"
echo " "
echo " << 返回主菜单，请输入：0"
echo " "
read Cache

if [ "$Cache" == "0" ]; then
	echo " "
	echo "即将返回主菜单，请稍等..."
	echo " "
	sleep 0.5
	exec ${PanelPath}/admin.sh
else
	if [ "$Cache" == "y" ]; then
		echo " "
		echo "=========================================================================================="
		echo "已选择：清除缓存"
		echo " "
		echo "即将清除缓存..."
		echo "=========================================================================================="
		echo " "
		hexo clean
		echo " "
		echo "=========================================================================================="
		echo "即将生成页面并部署发布（自动更新相册信息）..."
		echo "=========================================================================================="
		echo " "
		hexo deploy -gm "Updated by hexo-shell-admin {{ now('YYYY-MM-DD') }}"
		echo " "
		echo "=========================================================================================="
		echo "部署完成！即将打开 Coding Pages..."
		echo "=========================================================================================="
		echo " "
		sleep 2
		open https://dldylan.coding.me
		exec ${PanelPath}/admin.sh
	else
		if [ "$Cache" == "n" ]; then
			echo " "
			echo "=========================================================================================="
			echo "已选择：不清除缓存"
			echo " "
			echo "即将生成页面并部署发布（自动更新相册信息）..."
			echo "=========================================================================================="
			echo " "
			hexo deploy -gm "Updated by hexo-shell-admin {{ now('YYYY-MM-DD') }}"
			echo " "
			echo "=========================================================================================="
			echo "部署完成！即将打开 Coding Pages..."
			echo "=========================================================================================="
			echo " "
			sleep 2
			open https://dldylan.coding.me
			exec ${PanelPath}/admin.sh
		else
			echo " "
			echo "=========================================================================================="
			echo "输入错误，请返回重新选择..."
			echo "=========================================================================================="
			echo " "
			sleep 1.5
			exec ${ScriptPath}/deploy.sh
		fi
	fi
fi
