#!/bin/sh
ScriptPath=$(cd "$(dirname "$0")"; pwd)
cd ${ScriptPath}
cd ../
PanelPath=$(pwd)
cd ../
echo " "
echo "=========================================================================================="
echo "Step 1. 检查豆瓣文件："
echo " "
echo "1.1 请检查 source/books/ 文件夹 是否包含 index.html，检查后按下回车"
echo "=========================================================================================="
echo " "
ls source/books/
read answer
echo "=========================================================================================="
echo "1.2 请检查 source/movies/ 文件夹 是否包含 index.html，检查后按下回车"
echo "=========================================================================================="
echo " "
ls source/movies/
read answer
echo "=========================================================================================="
echo "1.3 请检查 source/assets/ 文件夹 是否包含 douban-loading.gif，检查后按下回车"
echo "=========================================================================================="
echo " "
ls source/assets/
read answer
echo "=========================================================================================="
echo "Step 2. 检查相册照片信息文件："
echo " "
echo "请检查 /source/photos/photoslist.json，检查后按下回车"
echo "=========================================================================================="
echo " "
cat -n source/photos/photoslist.json
read answer
echo "=========================================================================================="
echo "检查完毕！如果没有相关文件，请返回主菜单再重复一次。"
echo " "
echo "即将返回主菜单，请稍等..."
echo "=========================================================================================="
echo " "
sleep 1
exec ${PanelPath}/admin.sh