#!/bin/sh
echo " "
echo "=========================================================================================="
echo "=========================================================================================="
echo "                                 Hexo Blog Admin Panel "
echo " "
echo "                                    by Donglei Zhang "
echo " "
echo "                                 hexo-shell-admin v1.0.2 "
echo " "
echo "                                       June 2018 "
echo "=========================================================================================="
echo "=========================================================================================="
echo "                  Repository: https://github.com/dldylan/hexo-shell-admin "
echo " "
echo " "
echo "                                  Nice to see you again! "
echo " "
echo " "
PanelPath=$(cd "$(dirname "$0")"; pwd)
cd ${PanelPath}
cd ../
HexoPath=$(pwd)
rm -f source/photos/images/.DS_Store
echo "【Hexo目录】${HexoPath}"
echo " "
echo "   | 这个不是我的 Hexo 博客目录？"
echo "   | 请确认包含所有本平台脚本的文件夹已经放在 Hexo 根目录了哦～"
echo " "
echo " "
echo "【开始】输入对应的数字"
echo "    0. 退出"
echo "    1. 新建文章并打开编辑"
echo "    2. 新建页面并打开编辑"
echo "    3. 本地预览（自动更新相册信息）"
echo "    4. 部署发布到 GitHub 和 Coding（自动更新相册信息）"
echo "    5. 更新豆瓣页面并备份到 /source/ 文件夹"
echo "    6. 强制更新相册照片信息并保存到 /source/photos/ 文件夹"
echo "    7. 检查 /source/ 文件夹下有没有豆瓣、照片信息"
echo " "
read answer


if [ "$answer" == "1" ]; then
	echo " "
	echo "=========================================================================================="
	echo "已选择：新建文章并打开编辑器"
	echo " "
	echo "真棒，博客又要更新了呢～ 记得去公众号推送哦！ "
	echo "=========================================================================================="
	echo " "
	sleep 0.5
	exec ${PanelPath}/package/new_post.sh
else
	if [ "$answer" == "2" ]; then
		echo " "
		echo "=========================================================================================="
		echo "已选择：新建页面并打开编辑器"
		echo "=========================================================================================="
		echo " "
		sleep 0.5
		exec ${PanelPath}/package/new_page.sh
	else
		if [ "$answer" == "3" ]; then
			echo " "
			echo "=========================================================================================="
			echo "已选择：本地预览（自动更新相册信息）"
			echo "=========================================================================================="
			echo " "
			sleep 0.5
			exec ${PanelPath}/package/server.sh
		else
			if [ "$answer" == "4" ]; then
				echo " "
				echo "=========================================================================================="
				echo "已选择：部署发布到 GitHub 和 Coding（自动更新相册信息）"
				echo "=========================================================================================="
				echo " "
				sleep 0.5
				exec ${PanelPath}/package/deploy.sh
			else
				if [ "$answer" == "5" ]; then
					echo " "
					echo "=========================================================================================="
					echo "已选择：更新豆瓣页面并备份到 /source/ 文件夹"
					echo "=========================================================================================="
					echo " "
					sleep 0.5
					exec ${PanelPath}/package/douban.sh
				else
					if [ "$answer" == "6" ]; then
						echo " "
						echo "=========================================================================================="
						echo "已选择：强制更新相册照片信息并保存到 /source/photos/ 文件夹"
						echo " "
						echo "即将开始..."
						echo "=========================================================================================="
						echo " "
						sleep 0.5
						exec ${PanelPath}/package/photo.sh
					else
						if [ "$answer" == "7" ]; then
							echo " "
							echo "=========================================================================================="
							echo "已选择：检查 /source/ 文件夹下有没有豆瓣、照片信息"
							echo "=========================================================================================="
							echo " "
							sleep 0.5
							exec ${PanelPath}/package/filecheck.sh
						else
							if [ "$answer" == "0" ]; then
								echo " "
								echo "=========================================================================================="
								echo "感谢使用！"
								echo " "
								echo "即将退出终端，请稍等..."
								echo "=========================================================================================="
								echo " "
								sleep 1.5
								killall Terminal
							else
								echo " "
								echo "=========================================================================================="
								echo "输入错误，请返回重新选择..."
								echo "=========================================================================================="
								echo " "
								sleep 1.5
								exec ${PanelPath}/admin.sh
							fi
						fi
					fi
				fi
			fi
		fi
	fi
fi
